#!/usr/bin/env python

# --------------------------- 72 символа -------------------------------
# --------------------------- 79 символов -------------------------------------

"""Задание:

Расчёт сопротивления тройной сработки датчиков.
Начало: 10 ноября 2016 г. 14:38.
Обновлена:

"""

# Версия скрипта.  
TripleDetectedSensorVersion = '0.1'

"""Планирование разработки:

План работ на ver.0.X:
---------------------
1.Сделать костыль для расчёта.

"""
def StatusSHS(Rpr):
    """Функциф определения статуса ШС."""
    if (Rpr < 100):
        print (' КЗ ')
    if ((Rpr > 100) and (Rpr < 1560)):
        print (' Пожар ')
    if ((Rpr > 1100) and (Rpr < 1800)):
        print (' Внимание ')
    if ((Rpr > 2200) and (Rpr < 5400)):
        print (' Норма ')
    if (Rpr > 6600):
        print (' Обрыв ')

# Основная программа начинается с приветствия.
print ('\n')
print ('Скрипт TripleDetectedSensor ver.' + TripleDetectedSensorVersion)
print ('Реализован на языке программирования Python v.3.5.1')
print ('---------------------------------------------------')

# Инициализация переменных.
# Значение оконечного сопротивления в Омах.
Rok = 4700
# Значение дополнительного сопротивления №1 в Омах.
Rd1 = 3600
# Значение дополнительного сопротивления №2 в Омах.
Rd2 = 4700

print ('R1 = ', Rd1, ' R2 = ', Rd1, ' R3 = ', Rd2)
print ('---')

R1 = (Rd1 * Rok)/(Rd1 + Rok)
R12 = (Rd1 * Rok)/(Rd1 + (2 * Rok))
R123 = (Rd1 * Rok * Rd2)/((2 * Rd2 * Rok) + (Rd1 * Rok) + (Rd1 * Rd2))
R3 = (Rd2 * Rok)/(Rd2 + Rok)
R13 = (Rd1 * Rok * Rd2)/((Rd2 * Rok) + (Rd1 * Rok) + (Rd1 * Rd2))


print ('R1 = ', R1)
StatusSHS(R1)
print ('R3 = ', R3)
StatusSHS(R3)
print ('---')

print ('R12 = ', R12)
StatusSHS(R12)
print ('R13 = ', R13)
StatusSUS(R13)
print ('---')

print ('R123 = ', R123)
StatusSHS(R123)
print ('---')